import React from "react"
import { Text } from "react-native"
import tw from "twrnc";

export const Contract1 = () => {
    return (
        <Text style={tw`text-[#191919] text-sm leading-[19px] font-normal text-justify`}>
            제1장 총칙
            {'\n'}제1조 (목적)
            {'\n'}본 약관은 범객(이하 “회사”)이 운영하는 Artique “애플리케이션”(이하 “애플리케이션”을 “APP”이라고 합니다)의 서비스를 이용함에 있어 회사와 회원 간의 권리, 의무 및 책임사항, 서비스 이용조건 등 기본적인 사항을 규정하는 것을 목적으로 합니다. 
            {'\n'}{'\n'}제2조 (용어의 정의)
            {'\n'}1) 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
            {'\n'}1. ‘회원’이란 본 Artique 서비스 약관에 동의하고 계정을 생성한 자로서, App을 통하여 제공되는 서비스를 이용할 수 있는 자를 말합니다. 
            {'\n'}2. ‘서비스’라 함은 구현되는 모바일 기기를 통하여 회원이 이용할 수 있는 공연 정보, 리뷰 정보 등 회사가 제공하는 모든 제반 서비스를 의미합니다.
            {'\n'}3. ‘모바일 기기’란 콘텐츠를 다운로드 받거나 설치하여 사용할 수 있는 기기로서, 휴대폰, 스마트폰, 휴대정보단말기(PDA), 태블릿 등을 의미합니다. 
            {'\n'}4. ‘콘텐츠’라 함은 [정보통신망이용촉진 및 정보보호 등에 관한 법률] 제2조 제1항 제1호의 규정에 의한 정보통신망에서 사용되는 부호, 문자, 음성, 음향, 이미지 또는 영상 등으로 표현된 자료 또는 정보를 말합니다.
            {'\n'}5. ‘App’이란 회사가 제공하는 서비스를 이용하기 위하여 모바일 기기를 통해 다운로드 받거나 설치하여 사용하는 프로그램 일체를 의미합니다.
            {'\n'}6. ‘계정정보’란 회원의 회원번호와 카카오 등 외부 연동 계정정보, 기기정보 등 회원이 회사에 제공한 정보를 의미합니다.
            {'\n'}2) 이 약관에서 사용하는 용어의 정의는 본 조 제1항에서 정하는 것을 제외하고는 관계법령 및 서비스별 정책에서 정하는 바에 의하며, 이에 정하지 아니한 것은 일반적인 상 관례에 따릅니다.
            {'\n'}{'\n'}제3조 (약관의 효력 및 변경)
            {'\n'}1) 본 약관은 회원이 본 약관에 동의한 날로부터 회원 탈퇴 시까지 적용하는 것을 원칙으로 합니다. 단, 일부 조항은 회원이 탈퇴 후에도 유효하게 적용될 수 있습니다. 
            {'\n'}2) 회사는 불가피한 여건이나 사정이 있을 경우 [약관의 규제에 관한 법률], [정보통신망이용촉진 및 정보보호 등에 관한 법률]등 관련 법령에 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다. 
            {'\n'}3) 회사가 약관을 개정할 경우에는 적용일자 및 개정내용, 개정사유 등을 명시하여 최소한 그 적용일 7일 이전부터 App내에 게시하여 이용자에게 공지합니다. 다만, 변경된 내용이 회원에게 불리하거나 중대한 사항의 변경인 경우에는 그 적용일 30일 이전까지 이용자가 확인할 수 있도록 게시합니다. 회원은 변경된 약관에 동의하지 않을 경우, 회원 탈퇴를 할 수 있으며, 회원이 변경된 개정 약관의 효력 발생일 이후에도 서비스를 계속 이용할 경우, 개정약관이 적용됩니다. 
            {'\n'}{'\n'}제4조 (회원에 대한 통지)
            {'\n'}1) 회사가 회원에 대한 통지를 하는 경우, 회원이 회사에 제출한 이메일주소 또는 App을 통해 팝업 메시지, 알림 메시지 등의 방법으로 개별 통지할 수 있습니다. 
            {'\n'}2) 회사는 불특정다수 회원에 대한 통지의 경우 7일 이상 App에 게시함으로서 개별통지에 갈음할 수 있다. 
            {'\n'}{'\n'}제5조 (회원가입)
            {'\n'}1) 이용자는 정해진 가입 프로세스에 따라 서비스 이용 신청을 하고, 신청한 내용에 대해서 회사가 승낙함으로써 회원으로 가입됩니다. 
            {'\n'}2) 회사는 이용신청한 사용자에 대해서 서비스 이용을 승낙함을 원칙으로 합니다. 다만, 회사는 다음 각 호의 어느 하나에 해당하는 이용자에 대해서는 회원가입을 거절하거나 사후에 회원자격을 상실시킬 수 있습니다. 
            {'\n'}1. 회원정보 내용을 허위로 기재하거나 타인의 명의를 도용한 경우
            {'\n'}2. 회사가 서비스를 제공하지 않은 국가에서 비정상적이거나 우회적인 방법을 통해 서비스를 이용하는 경우
            {'\n'}3. 회사의 정책에 적합하지 않은 회원으로 판단되는 경우 또는 서비스 제공이 곤란한 경우
            {'\n'}4. 부정한 용도로 서비스를 이용하고자 하는 경우
            {'\n'}5. 이용 목적이나 서비스 이용 방법이 회사의 재산권이나 영업권을 침해하거나 침해할 우려가 있는 경우
            {'\n'}6. 가입 신청자가 본 약관에 의거 이전에 회원자격을 상실한 적이 있는 경우
            {'\n'}7. 그 밖에 각 호에 준하는 사유로서 승낙이 부적절하다고 판단되는 경우
            {'\n'}3) 회원은 회원 가입 시 기재한 개인정보의 내용에 변경이 발생한 경우, 즉시 변경사항을 정정하여 기재하여야 합니다. 변경의 지체로 인하여 발생한 회원의 손해에 대해 회사는 책임을 지지 않습니다.
            {'\n'}4) 회사는 관련 법률 및 회사의 개인정보처리방침에서 정한 바에 따라 회원에게 제공을 요청하는 회원정보 및 기타정보 항목을 추가, 삭제 등 변경하여 수집 및 이용할 수 있습니다. 
            {'\n'}{'\n'}제6조 (회원탈퇴 및 자격상실)
            {'\n'}1) 회원은 언제든지 서비스 이용을 원치 않는 경우 탈퇴를 요청할 수 있으며, 이 경우 회사는 즉시 회원탈퇴를 처리합니다. 회원탈퇴로 인해 회원이 서비스 내에서 보유한 이용정보는 모두 삭제되어 복구가 불가능하게 됩니다.
            {'\n'}2) 회사는 회원이 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 등 본 계약을 유지할 수 없는 중대한 사유가 있는 경우에는 회원에게 통지하고, 서비스 이용을 제한.중지하거나 회원 자격을 상실시킬 수 있습니다.
            {'\n'}3) 회사가 회원자격을 상실시키는 경우에는 회원 등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원 등록 말소 전에 소명할 기회를 부여합니다. 단, 회사가 정한 소명 기간 동안 소명하지 않은 경우 회원 등록 말소 동의로 간주합니다. 
            {'\n'}4) 회사는 최근의 서비스 이용일부터 연속하여 1년 동안 회사의 서비스를 이용하지 않은 회원(이하 “휴면계정”이라 합니다)의 개인정보를 보호하기 위해 이용계약을 정지 또는 해지하고 회원의 개인정보를 분리보관 또는 파기 등의 조치를 취할 수 있습니다. 이 경우 조치일 30일 전까지 계약 정지 또는 해지, 개인정보 분리보관 또는 파기 등의 조치가 취해진다는 사실 및 파기될 개인정보 등을 회원에게 통지합니다.
            {'\n'}{'\n'}제7조 (회사의 의무)
            {'\n'}1) 회사는 관련 법령과 본 약관에서 정하는 권리의 행사 및 의무의 이행을 신의에 따라 성실하게 준수하며, 지속적이고 안정적인 서비스의 제공을 위하여 최선을 다하여 노력합니다.
            {'\n'}2) 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함) 보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다. 회사는 이 약관 및 개인정보처리방침에서 정한 경우를 제외하고는 회원의 개인정보가 제3자에게 공개 또는 제공되지 않도록 합니다. 
            {'\n'}3) 회사는 국가비상사태, 정전, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 서비스 제공이 불가능할 경우, 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다. 다만, 이 경우 그 사유 및 기간 등을 회원에게 사전 또는 사후에 공지합니다.
            {'\n'}{'\n'}제8조 (회원의 의무)
            {'\n'}1) 회원은 회사에서 제공하는 서비스의 이용과 관련하여 다음 각 호에 해당하는 행위를 해서는 안 됩니다.
            {'\n'}1. 이용신청 또는 회원 정보 변경 시 타인의 명의를 도용하거나 허위 사실을 기재하는 행위
            {'\n'}2. 회사를 사칭하거나 관련 정보를 도용하는 행위
            {'\n'}3. 다른 회원의 개인정보를 무단으로 수집·저장·게시 또는 유포하는 행위
            {'\n'}4. 서비스를 무단으로 본래의 용도 이외의 용도로 이용하는 행위
            {'\n'}5. 회사의 서비스를 이용하여 얻은 정보를 무단으로 변경·유포하거나, 상업적으로 이용하는 행위
            {'\n'}6. 회사나 기타 제3자의 저작권, 영업비밀, 특허권 등 지적재산권을 침해하는 행위
            {'\n'}7. 회사나 다른 회원 및 기타 제3자를 희롱하거나, 위협하거나 명예를 손상시키는 행위
            {'\n'}8. 법령에 의하여 전송 또는 게시가 금지된 정보(컴퓨터 프로그램)나 컴퓨터 소프트웨어·하드웨어 또는 전기통신장비의 정상적인 작동을 방해·파괴할 목적으로 고안된 바이러스·컴퓨터 코드·파일·프로그램 등을 고의로 전송·게시·유포 또는 사용하는 행위
            {'\n'}9. 회사의 동의 없이 서비스 또는 이에 포함된 소프트웨어의 일부를 복사, 수정, 배포, 판매, 양도, 대여하거나 타인에게 그 이용을 허락하는 행위와 소프트웨어를 역설계하거나 소스 코드의 추출을 시도하는 등 서비스를 복제, 분해 또는 모방하거나 기타 변형하는 행위
            {'\n'}10. 그 밖에 관련 법령에 위반되거나 선량한 풍속 기타 사회통념에 반하는 행위
            {'\n'}2) 회사는 회원이 전항에서 금지한 행위를 하는 경우, 위반 행위의 경중에 따라 서비스의 이용정지/계약의 해지 등 서비스 이용 제한, 수사 기관에의 고발 조치 등 합당한 조치를 취할 수 있습니다. 
            {'\n'}3) 회원의 ID와 비밀번호에 관한 관리책임은 회원에게 있으며, 이를 제3자가 이용하도록 하여서는 안됩니다. 
            {'\n'}4) 회원은 회사의 사전 허락 없이 회사가 정한 이용 목적과 방법에 반하여 영업/광고 활동 등을 할 수 없고, 회원의 서비스 이용이 회사의 재산권, 영업권 또는 비즈니스 모델을 침해하여서는 안됩니다. 이용자는 본 약관 및 관련법령에 규정한 사항을 준수하여야 하며, 회사는 회원이 본 조에서 규정한 의무를 위반하여 발생한 일체의 문제에 대해서는 책임을 지지 않습니다.
            {'\n'}{'\n'}제9조 (서비스의 제공)
            {'\n'}1) 회사는 회원에게 아래와 같은 서비스를 제공합니다.
            {'\n'}1. 국내 연극, 뮤지컬 공연 정보 제공 서비스
            {'\n'}2. 공연 리뷰 등록 서비스
            {'\n'}3. 기타 회사가 추가 개발하거나 다른 회사와의 제휴 계약 등을 통해 회원에게 제공하는 일체의 서비스
            {'\n'}2) 회사는 회원의 가입신청을 승낙한 때부터 서비스를 개시합니다.
            {'\n'}3) 서비스 이용시간은 회사의 업무상 또는 기술상 불가능한 경우를 제외하고는 연중무휴 1일 24시간(00:00-24:00)으로 함을 원칙으로 합니다.
            {'\n'}4) 회사는 제공하는 서비스의 형태와 기능, 디자인 등은 필요한 경우 수시로 변경되거나 중단될 수 있습니다. 이에 대하여 관련 법령에 특별한 규정이 없는 한 회원에게도 별도의 보상을 하지 않습니다. 다만 회원에게 불리할 것으로 판단되는 경우 이메일 혹은 앱 내 알림 등을 통하여 이를 공지합니다.
            {'\n'}5) 회사는 회원에게 별도의 동의를 받은 경우 서비스 이용에 대한 유용한 각종 정보에 대하여 App에 게재하는 것 이외에 푸시(Push) 알림 등의 방법으로 회원에게 제공할 수 있습니다.
            {'\n'}{'\n'}제10조 (개인정보의 보호 및 사용)
            {'\n'}1) 회사는 이용자의 정보 수집시 원활한 서비스 제공을 위해 필요한 최소한의 정보를 수집하며, 정보통신망법 등 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다. 
            {'\n'}2) 회사는 서비스를 중단하거나 회원이 개인정보 제공 동의를 철회한 경우 신속하게 회원의 개인정보를 파기합니다. 단, 전자상거래 등에서의 소비자보호에 관한 법률 등 관련 법률에서 정하는 바에 따라 일정 정보는 보관할 수 있습니다.
            {'\n'}3) 회사는 서비스 개선 및 회원 대상 서비스 소개 등의 목적으로 회원의 동의 하에 관계 법령에서 정하는 바에 따라 추가적인 개인정보를 수집할 수 있습니다. 
            {'\n'}4) 회사는 관련 법령에 의하거나, 관련 국가기관 등의 요청이 있는 경우를 제외하고는 회원의 개인정보를 본인의 동의 없이 제3자에게 공개하거나 제공하지 아니합니다.
            {'\n'}5) 기타 개인정보관련사항은 별도로 게시하는 개인정보취급방침에 의거합니다.
            {'\n'}{'\n'}제11조 (광고의 게재)
            {'\n'}1) 회사는 서비스의 제공을 위해 서비스 내부에 광고를 게재할 수 있습니다.
            {'\n'}2) 회사는 서비스 운영과 관련하여 회원정보, 회원이 입력한 정보를 활용하여 광고를 게재할 수 있습니다. 회원은 서비스 이용 시 노출되는 맞춤 광고 게재에 대해 동의합니다. 
            {'\n'}3) 회사는 서비스 상에 게재되어 있거나 서비스를 통한 광고주의 판촉활동에 회원이 참여하거나 교신 또는 거래함으로써 발생하는 손실과 손해에 대해 책임지지 않습니다.
            {'\n'}{'\n'}제12조 (게시물의 권리와 책임)
            {'\n'}1) 서비스에 대한 저작권 및 지적재산권, 회사가 작성한 게시물의 저작권은 회사에 귀속되고, 회원이 회사의 서비스를 이용하면서 생성한 콘텐츠도 모두 회사에 귀속되며, 회사는 위 콘텐츠를 분석하거나 사용할 수 있습니다. 단, 제휴 계약에 따라 제공된 저작물 등은 제외합니다. 
            {'\n'}2) 회원은 서비스를 이용하는 과정에서 회원이 작성한 텍스트, 이미지 등의 기타 정보 (이하 ‘게시물’)에 대한 책임 및 권리를 보유하며, 해당 게시물이 타인의 지적 재산권을 침해하여 발생하는 모든 책임 또한 회원 본인에게 귀속됩니다.
            {'\n'}3) 회원은 자신이 서비스 내에 게시한 게시물을 회사가 다음과 같은 목적으로 사용하는 것을 허락합니다. 
            {'\n'}1. 서비스 내에서 게시물을 사용하기 위하여 게시물의 크기를 변환하거나 단순화하는 등의 방식으로 수정 혹은 게시물 위치를 이동하는 경우
            {'\n'}2. 회사의 서비스를 홍보하기 위한 목적으로 미디어, 통신사 등에게 게시물의 내용을 보도, 방영하는 경 (단, 이 경우 회원의 개별 동의 없이 회원정보를 제공하지 않습니다.)
            {'\n'}3. 서비스 개선 및 서비스 개발을 위해 게시물의 내용을 분석 활용하는 경우
            {'\n'}4) 회원은 회사가 제공하는 서비스를 이용하여 얻은 정보 중에서 회사 또는 제공업체에 지적재산권이 귀속된 정보를 회사 또는 제공업체의 사전 동의 없이 복제·전송 등의 방법(편집, 공표, 공연, 배포, 방송, 2차적 저작물 작성 등을 포함합니다. 이하 같습니다)에 의하여 영리목적으로 이용하거나 타인에게 이용하게 하여서는 안됩니다.
            {'\n'}5) 회원의 게시물이 정보통신망법 및 저작권법 등 관련법에 위반되는 내용을 포함하는 경우, 관리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 이로 인해 발생하는 민·형사상의 책임은 전적으로 해당 회원 본인이 부담하여야 하며, 회사는 관련법에 따라 조치를 취하여야 합니다.
            {'\n'}6) 회사는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 게시물에 대해 임시조치 등을 취할 수 있습니다. 
            {'\n'}7) 이 조는 회사가 서비스를 운영하는 동안 유효하며, 회원 탈퇴 후에도 지속적으로 적용됩니다.
            {'\n'}{'\n'}제13조 (게시물의 관리)
            {'\n'}1) 회원이 서비스 내에 작성한 게시물에 대한 책임 및 권리는 게시물을 등록한 회원에게 있습니다. 
            {'\n'}2) 회사는 회원이 작성한 콘텐츠에 대해서 감시 및 관리할 수 없으며 이에 대해서 책임지지 않습니다. 
            {'\n'}3) 회사는 회원이 등록하는 게시물의 신뢰성, 진실성, 정확성 등에 대해서 책임지지 않으며 보증하지 않습니다. 
            {'\n'}4) 회원의 게시물이 정보통신망법 및 저작권법 등 관련법에 위반되는 내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 회사는 관련법에 따라 조치를 취하여야 합니다. 
            {'\n'}5) 회사는 다음 각 호와 같은 내용의 게시물이 서비스 내에 게재되는 경우 제한할 수 있습닌다. 
            {'\n'}1. 사생활 침해, 명예훼손, 욕설, 비속어로 타인에게 불쾌감을 주는 경우
            {'\n'}2. 공서양속 저해 및 특정 집단, 단체, 종교 비하로 타인에게 불쾌감을 주는 경우
            {'\n'}3. 확인되지 않거나 근거 없는 내용으로 타인의 권리를 침해하는 경우
            {'\n'}4. 타인의 저작권을 침해하는 경우
            {'\n'}5. 타인의 개인정보가 포함된 경우
            {'\n'}6. 동일 내용의 게시물을 반복 게재하는 경우
            {'\n'}7. 악성코드 등 회사의 원활한 서비스 제공을 방해하는 경우
            {'\n'}8. 기타 회원의 원활한 서비스 이용에 불건전한 영향을 미칠 수 있다고 판단되는 경우
            {'\n'}6) 회원이 회원가입 계약을 해지한 경우에는 본인이 작성한 저작물 일체는 삭제되며, 복구되지 않습니다. 
            {'\n'}7) 회사는 다른 회원을 보호하고, 법원, 수사시관 또는 관련 기관의 요청에 따른 증거자료로 활용하기 위해 본 약관 및 관계 법령을 위반한 회원이 회원가입 계약을 해지한 후에도 회사의 개인정보취급방침상 보존기간 및 관계 법령에 따라서 회원의 아이디 및 회원정보를 보존할 수 있습니다. 
            {'\n'}{'\n'}제14조 (데이터 수집)
            {'\n'}회사는 회원의 서비스 이용 단말기의 데이터를 수집하고 이용할 수 있으며, 수집된 데이터는 서비스를 개선하거나 이용자의 사용환경 에 적합한 서비스 또는 기술을 제공하기 위한 목적으로만 사용하며 그 외의 다른 목적으로 사용하지 않습니다.
            {'\n'}{'\n'}제15조 (회원의 고충처리 및 분쟁해결)
            {'\n'}① 회사는 회원의 편의를 고려하여 회원의 의견이나 불만을 제시하는 방법을 서비스 내 또는 그 연결화면에 안내합니다.
            {'\n'}② 회사는 회원으로부터 제기되는 의견이나 불만이 정당하다고 객관적으로 인정될 경우에는 합리적인 기간 내에 이를 신속하게 처리 합니다. 다만, 처리에 장기간이 소요되는 경우에는 회원에게 장기간 이 소요되는 사유와 처리일정을 별도로 공지합니다.
            {'\n'}{'\n'}제16조 (회사의 면책)
            {'\n'}① 회사는 다음 각 호의 사유로 인하여 회원 또는 제3자에게 발생한 손해에 대하여는 그 책임을 지지 않습니다. 다만, 회사의 고의 또는 중대한 과실로 인하여 발생한 손해의 경우는 제외합니다.
            {'\n'}1. 천재지변, 전쟁, 기간통신사업자의 서비스 중지 등 해결이 곤란한 기술적 결함, 기타 불가항력으로 인해 서비스를 제공할 수 없는 경우
            {'\n'}2. 회원이 자신의 아이디 또는 비밀번호 등의 관리를 소홀히 한 경
            {'\n'}3. 회사의 관리영역이 아닌 공중통신선로의 장애로 서비스 이용이 불가능한 경우
            {'\n'}4. 기타 회사의 귀책사유가 없는 통신서비스 등의 장애로 인한 경우
            {'\n'}② 회사는 약관, 서비스 이용 방법 및 이용 기준을 준수하지 않는 등 회원의 귀책사유로 인한 서비스 이용의 장애에 대한 책임을 지지 않 습니다.
            {'\n'}③ 회사는 회원 간 또는 회원과 제3자 상호간에 서비스를 매개로 하 여 거래 등을 한 경우에는 책임이 면제됩니다.
            {'\n'}④ 회사는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책, 운영 상의 사유로 수정, 중단, 변경할 수 있으며, 이에 대하여 관련 법령에 별도 규정이 있지 아니하는 한 별도의 보상을 하지 않습니다.
            {'\n'}③ 회사는 회원 또는 제3자가 서비스 내 게시 또는 전송한 정보, 자료, 사실의 신뢰성, 정확성 등에 대하여 보증하지 않으며, 회사의 고의 또는 중대한 과실이 없는 한 책임을 지지 않습니다.
            {'\n'}⑥ 회사는 회원이 서비스를 이용하여 기대하는 이익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않습니다.
            {'\n'}⑦ 회원이 모바일 기기의 변경, 모바일 기기의 번호 변경, 운영체제 (OS) 버전의 변경, 해외 로밍, 통신사 변경 등으로 인해 콘텐츠 전 부나 일부의 기능을 이용할 수 없는 경우 회사는 이에 대해 책임을 지지않습니다.
            {'\n'}{'\n'}제17조 (재판권 및 준거법)
            {'\n'}이 약관은 대한민국 법률에 따라 규율되고 해석됩니다. 회사와 회원 간에 발생한 분쟁으로 소송이 제기되는 경우에는 법령에 정한 절차 에 따른 법원을 관할 법원으로 합니다.
            {'\n'}{'\n'}제18조 (약관 외 준칙)
            {'\n'}이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 「약관의 규제에 관한 법률」, 「정보통신망이용촉진 및 정보보호 등에 관 한 법률」등 관련 법령 또는 상 관례에 따릅니다.
        </Text>
    )
}

export const Contract2 = () => {
    return (
        <Text style={tw`text-[#191919] text-sm leading-[19px] font-normal text-justify`}>
        개인정보 처리방침 
        {'\n'}본 방침은 2023년 11월 19일부터 적용됩니다.
        {'\n'}{'\n'}총칙
        {'\n'}범객(이하 "회사"라 함)은 개인정보보호 관한 법률을 준수하며 회원님의 개인정보가 보호받을 수 있도록 최선을 다하고 있습니다. 회사는 개인정보처리방침의 공개를 통하여 회원 여러분의 개인정보 가 어떠한 목적과 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고 있는지를 알려드립니다.
        {'\n'}본 개인정보처리방침은 관련법령의 개정이나 당사 내부방침에 의해 변경될 수 있으며, 이를 개정하는 경우 회사는 변경사항에 대하여 서비스 화면에 게시합니다. 회원님께서는 Artique App 접속 시 수시로 확인하시기 바랍니다.
        {'\n'}{'\n'}[개인정보 처리 목적]
        {'\n'}회사는 이용자의 개인정보를 다음의 목적 이외의 용도로는 이용하지 않으며, 이용 목적이 변경될 경우에는 동의를 받아 처리하겠습니다.
        {'\n'}① 회원 관리: 회원제 서비스 이용에 따른 본인확인, 개인식별, 부정 이용 방지, 가입의사 확인, 문의사항 또는 불만처리 등 민원처리, 분쟁조정 해결을 위한 기록 보존, 고지사항 전달
        {'\n'}② 서비스 제공에 관한 계약의 이행: 서비스 제공, 콘텐츠 제공, 맞춤서비스 제공, 본인인증
        {'\n'}③ 신규 서비스 및 마케팅에 활용: 이용자에게 최적화된 서비스 제공, 이용자의 관심 및 성향 추정에 따른 맞춤형 컨텐츠 추천, 신규 서비스 및 상품 개발, 이벤트 정보 및 광고성 정보 제공 등 마케팅 및 프로모션, 접속 빈도 파악, 프라이버시 보호 측면의 서비스 환경 구축 및 개선, 서비스 유지관리 및 품질 향상 
        {'\n'}{'\n'}[수집하는 개인정보의 항목범위 및 수집 방법]
        {'\n'}회사는 다음과 같은 방식으로 개인정보를 수집합니다.
        {'\n'}① 회원가입 및 서비스 이용 과정에서 이용자가 개인정보 수집에 대해 동의를 하고 직접 정보를 입력하는 경우 개인정보를 수집합니다.
        {'\n'}② 온라인, 오프라인에서 진행되는 이벤트 등을 통해 이름, 휴대전화번호, 주소 등 추가적인 개인정보가 수집될 수 있습니다.
        {'\n'}③ 제휴 회사로부터의 제공을 통해 개인정보가 수집될 수 있습니다.
        {'\n'}④ 고객센터를 통한 상담 과정에서 이메일, 팩스, 전화 등을 통해 개인정보가 수집될 수 있습니다.
        {'\n'}⑤ 회원 대상 맞춤형 추천 서비스 제공을 목적으로 이용자를 특정할 수 없는 이용한 서비스의 정보, 접속시간 및 빈도 등의 행태 정보를 수집할 수 있습니다.
        {'\n'}⑥ 기기정보와 같은 생성정보는 PC웹, 모바일 웹/앱 이용 과정에서 자동으로 생성되어 수집될 수 있습니다.
        {'\n'}{'\n'}회사는 기본적 인권침해의 우려가 있는 개인정보(인종 및 민족, 사상 및 신조, 출신지 및 본적지, 정치적 성향 및 범죄기록, 건강상태 및 성생활 등)를 요구하지 않으며, 위의 항목 이외에 다른 어떠한 목적으로도 수집, 사용하지 않습니다.
        {'\n'}{'\n'}[개인정보의 제3자 제공]
        {'\n'}회사는 원칙적으로 이용자 동의 없이 개인정보를 외부에 공개하지 않습니다. 다만, 다양한 혜택을 제공하기 위해 외부 제휴사에 개인 정보를 제공합니다. 제공이 필요한 경우 회사는 사전에 회원에게 '개인정보를 제공받는 자, 제공목적, 제공하는 개인정보 항목, 제공 받는 개인정보의 보유 및 이용기간'을 고지하고 이에 대해 명시적•개별적 동의를 얻습니다.
        {'\n'}다만, 아래의 경우에는 예외로 합니다.
        {'\n'}① 이용자가 사전에 동의한 경우
        {'\n'}② 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정개인을 식별할 수 없는 형태로 제공하는 경우
        {'\n'}③ 영업의 양도•합병 등에 관한 사유가 발생하는 경우(단, 회사는 영업의 양도 등에 관한 사유가 발생하여 이용자의 개인정보 이전이 필요한 경우, 관계법률에서 규정한 절차와 방법에 따라 개인정보 이전 에 관한 사실 등을 사전에 고지하며, 이용자에게는 개인정보 이전에 관한 동의 철회권을 부여합니다.)
        {'\n'}④ 그 밖에 법률에 특별한 규정이 있는 경우
        {'\n'}{'\n'}[개인정보 보유 기간 및 파기]
        {'\n'}① 회원의 개인정보는 개인정보의 수집목적 또는 제공받은 목적이 달성되면 파기됩니다. 회원이 회원탈퇴를 하거나 개인정보 허위기재로 인해 회원 ID 삭제 처분을 받은 경우 수집된 개인정보는 완전히 삭제되며 어떠한 용도로도 이용할 수 없도록 처리됩니다.
        {'\n'}② 단, 아래 각 항목에 해당하는 경우에는 명시한 기간 동안 보관할 수 있으며, 그 외 다른 목적으로는 사용하지 않습니다.
        {'\n'}- 불건전한 서비스 이용으로 서비스에 물의를 일으킨 이용자의 경우 사법기관 수사의뢰를 하거나 다른 회원을 보호할 목적으로 1년간 해당 개인정보를 보관할 수 있습니다.
        {'\n'}- 관계법령의 규정에 의하여 보관할 필요가 있는 경우 회사는 개인 정보 수집 및 이용 목적 달성 후에도 관계법령에서 정한 일정 기간동안 회원의 개인정보를 보관할 수 있습니다.
        {'\n'}ㄱ. 계약 또는 청약철회 등에 관한 기록: 5년
        {'\n'}ㄴ. 소비자의 불만 또는 분쟁처리에 관한 기록: 3년
        {'\n'}ㄷ. 표시, 광고에 관한 기록: 6개월
        {'\n'}ㄹ 웹사이트 방문기록: 3개월
        {'\n'}③ 회사는 '개인정보 유효기간제'에 따라 1년간 서비스를 이용하지 않은 회원의 개인정보를 별도로 분리 보관하여 관리합니다.
        {'\n'}{'\n'}[회원 및 법정 대리인의 권리와 그 행사방법]
        {'\n'}① 회원 및 법정대리인은 언제든지 개인정보 보호 관련 권리(개인정보열람요구, 오류 등이 있을 경우 정정 및 삭제)를 행사할 수 있으며, 그 절차는 다음과 같습니다.
        {'\n'}- 회원의 개인정보는 Artique App의 [마이 페이지] {">"} [설정] {">"} [내 계정]에서 조회가 가능합니다. 개인정보 수정이 필요할 경우, 연동 된 SNS 계정을 통해 수정 가능합니다.
        {'\n'}- 회원의 가입해지 및 삭제를 위해서는 Artique App의 [마이 페이지] {">"} [설정] {">"} [내 계정] {">"} [탈퇴하기]를 클릭하여 탈퇴가 가능합니다.
        {'\n'}- 또는 Artique App의 [마이 페이지] {">"} [설정] {">"} [고객센터] {">"} [1:1 문의]를 통해 개인정보 수정 및 회원 탈퇴를 요청하실 수 있습니다.
        {'\n'}② 회원이 개인정보의 오류에 대한 정정을 요청한 경우, 정정을 완료하기 전까지 당해 개인정보를 이용하거나 제3자에 제공하지 않습니다. 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제 3자에게 지체 없이 통지하여 정정하도록 조치하겠습니다. 단, 다음과 같은 경우에는 예외적으로 개인정보의 열람 및 정정을 제한할 수 있습니다.
        {'\n'}- 본인 또는 제 3 자의 생명, 신체, 재산 또는 권익을 현저하게 해할 우려가 있는 경우
        {'\n'}- 당해 서비스 제공자의 업무에 현저한 지장을 미칠 우려가 있는 경우
        {'\n'}- 법령에 위반하는 경우
        {'\n'}{'\n'}[회원의 권리와 의무]
        {'\n'}회원은 본인의 개인정보를 최신의 상태로 정확하게 입력하여 불의의 사고를 예방해주시기 바랍니다. 회원이 입력한 부정확한 정보로 인해 발생하는 사고의 책임은 회원 자신에게 있으며 타인 정보의 도용 등 허위정보를 입력할 경우 계정의 이용이 제한될 수 있습니다.
        {'\n'}회사가 운영하는 서비스를 이용하는 회원은 개인정보를 보호받을 권리와 함께 스스로를 보호하고 타인의 정보를 침해하지 않을 의무도 가지고 있습니다. 회원은 이메일, 아이디(ID), 비밀번호를 포함한 개인정보가 유출되지 않도록 조심하여야 하며, 게시물을 포함한 타인의 개인정보를 훼손하지 않도록 유의해야 합니다. 만약 이 같은 책임을 다하지 못하고 타인의 정보 및 타인의 존엄성을 훼손할 경우에는 정보통신망법 등에 의해 처벌받을 수 있습니다.
        {'\n'}{'\n'}[고지의 의무]
        {'\n'}현 「개인정보처리방침」 내용의 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일 전부터 Artique App의 '공지사항'을 통해 고지하고, 개정 내용이 회원에게 불리할 경우에는 개정 30일전부터 고지할 것입니다. 변경 관련 문의는 고객센터를 통해 할 수 있습니다.
        {'\n'}{'\n'}[개인정보의 안전성 확보조치]
        {'\n'}회사는 회원의 개인정보를 처리함에 있어 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적/물리적 보호대책을 강구하고 있습니다
        {'\n'}① 정기적인 자체 감사 실시
        {'\n'}개인정보 취급 관련 안정성 확보를 위해 정기적으로 자체 감사를 실시하고 있습니다.
        {'\n'}② 개인정보 취급 직원의 최소화 및 교육
        {'\n'}개인정보를 취급하는 담당자를 지정하고 담당자에 한정시켜 최소화하여 개인정보를 관리하는 대책을 시행하고 있습니다.
        {'\n'}③ 해킹 등에 대한 대비책
        {'\n'}회사는 이용자의 개인정보를 주기적으로 백업하고 있으며, 암호화 알고리즘에 의해 네트워크상에서 안전하게 전송됩니다. 또한, 회사는 가능한 기술적 장치를 모두 갖추려고 노력하는 등 이용자의 개인 정보를 안전하게 보관하기 위해 노력하고 있습니다.
        {'\n'}④ 개인정보에 대한 접근 제한
        {'\n'}개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여, 변경, 말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
        {'\n'}{'\n'}[개인정보 보호 담당]
        {'\n'}회사는 회원의 개인정보보호를 가장 중요시하며, 회원의 개인정보가 훼손, 침해 또는 누설되지 않도록 최선을 다하고 있습니다. 서비스를 이용하시면서 발생하는 모든 개인정보보호 관련 민원은 고객 센터에 신고하시면 신속하게 답변해 드리도록 하겠습니다.
        {'\n'}성명: 설원상
        {'\n'}소속: 고객상담센터
        {'\n'}전자우편: artique.luta@gmail.com
        {'\n'}기타 개인정보에 관한 상담이 필요한 경우에는 정보통신부 산하 공공기관인 한국인터넷진흥원(KISA) 개인정보침해신고센터, 경찰청사이버테러대응센터, 대검찰청 사이버범죄수사단으로 문의하시기 바랍니다.
        </Text>
    )
}